app/Models/clientesModel.php

SELECT *
FROM `cliente`
WHERE `estatus` = 1
---
    function leyendoCliente(){
        $db = \Config\Database::connect();
            $builder = $db->table('cliente');
            $builder->select("*");
            $builder->where('estatus', 1);
            $query = $builder->get();

UPDATE `cliente` SET `id_cliente` = '3', `estatus` = 0
WHERE `id_cliente` = '3'
---
    function deletedata($data){
        $db = \Config\Database::connect();
        $builder = $db->table('cliente');
        $builder->where('id_cliente', $data["id_cliente"]);
        $result = $builder->update($data);